<!-- stack:example-api:dev -->
### Plan: `example-api` / `dev`

<details><summary>Show plan</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.service.google_cloud_run_v2_service.service must be replaced
-/+ resource "google_cloud_run_v2_service" "service" {
      - annotations             = {} -> null
      ~ conditions              = [
          - {
              - last_transition_time = "2026-03-24T16:30:05.147512Z"
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "RoutesReady"
                # (5 unchanged attributes hidden)
            },
          - {
              - last_transition_time = "2026-03-24T16:30:01.000941Z"
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "ConfigurationsReady"
                # (5 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ create_time             = "2026-03-24T16:29:58.845079Z" -> (known after apply)
      ~ creator                 = "tf-ci-164@freestar-491214.iam.gserviceaccount.com" -> (known after apply)
      - custom_audiences        = [] -> null
      + delete_time             = (known after apply)
      ~ effective_annotations   = {} -> (known after apply)
      ~ etag                    = "\"COb6jM4GEJiPgYID/cHJvamVjdHMvZnJlZXN0YXItNDkxMjE0L2xvY2F0aW9ucy91cy1jZW50cmFsMS9zZXJ2aWNlcy9leGFtcGxlLWFwaQ\"" -> (known after apply)
      + expire_time             = (known after apply)
      ~ generation              = "1" -> (known after apply)
      ~ id                      = "projects/freestar-491214/locations/us-central1/services/example-api" -> (known after apply)
      - invoker_iam_disabled    = false -> null
      ~ last_modifier           = "tf-ci-164@freestar-491214.iam.gserviceaccount.com" -> (known after apply)
      ~ latest_created_revision = "projects/freestar-491214/locations/us-central1/services/example-api/revisions/example-api-00001-9n9" -> (known after apply)
      ~ latest_ready_revision   = "projects/freestar-491214/locations/us-central1/services/example-api/revisions/example-api-00001-9n9" -> (known after apply)
      ~ launch_stage            = "GA" -> (known after apply)
      ~ name                    = "example-api" -> "dev-example-api" # forces replacement
      ~ observed_generation     = "1" -> (known after apply)
      ~ reconciling             = false -> (known after apply)
      ~ terminal_condition      = [
          - {
              - last_transition_time = "2026-03-24T16:30:05.188272Z"
              - state                = "CONDITION_SUCCEEDED"
              - type                 = "Ready"
                # (5 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ traffic_statuses        = [
          - {
              - percent  = 100
              - type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
                # (3 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ uid                     = "522d962e-15fb-4395-b898-24583db6e703" -> (known after apply)
      ~ update_time             = "2026-03-25T01:41:58.809519Z" -> (known after apply)
      ~ uri                     = "https://example-api-bklbobkrsq-uc.a.run.app" -> (known after apply)
      ~ urls                    = [
          - "https://example-api-1092997279819.us-central1.run.app",
          - "https://example-api-bklbobkrsq-uc.a.run.app",
        ] -> (known after apply)
        # (10 unchanged attributes hidden)

      - scaling {
          - manual_instance_count = 0 -> null
          - min_instance_count    = 0 -> null
            # (1 unchanged attribute hidden)
        }

      ~ template {
          - annotations                      = {} -> null
          - gpu_zonal_redundancy_disabled    = false -> null
          - labels                           = {} -> null
          ~ max_instance_request_concurrency = 80 -> (known after apply)
          ~ service_account                  = "exampleapi@freestar-491214.iam.gserviceaccount.com" -> "devexampleapi@freestar-491214.iam.gserviceaccount.com"
          - session_affinity                 = false -> null
          ~ timeout                          = "300s" -> (known after apply)
            # (3 unchanged attributes hidden)

          ~ containers {
              ~ build_info     = [] -> (known after apply)
              - depends_on     = [] -> null
                name           = null
                # (5 unchanged attributes hidden)

              ~ ports {
                  ~ name           = "http1" -> (known after apply)
                    # (1 unchanged attribute hidden)
                }

              ~ resources {
                  - cpu_idle          = false -> null
                  - startup_cpu_boost = false -> null
                    # (1 unchanged attribute hidden)
                }

              ~ startup_probe (known after apply)
              - startup_probe {
                  - failure_threshold     = 1 -> null
                  - initial_delay_seconds = 0 -> null
                  - period_seconds        = 240 -> null
                  - timeout_seconds       = 240 -> null

                  - tcp_socket {
                      - port = 8080 -> null
                    }
                }

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

      ~ traffic (known after apply)
      - traffic {
          - percent  = 100 -> null
          - type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.service.google_cloud_run_v2_service_iam_member.invoker["allUsers"] must be replaced
-/+ resource "google_cloud_run_v2_service_iam_member" "invoker" {
      ~ etag     = "BwZNx6o6tY0=" -> (known after apply)
      ~ id       = "projects/freestar-491214/locations/us-central1/services/example-api/roles/run.invoker/allUsers" -> (known after apply)
      ~ name     = "projects/freestar-491214/locations/us-central1/services/example-api" -> "dev-example-api" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.service.google_secret_manager_secret_iam_member.secret_access["dev-example-api-app-secret"] must be replaced
-/+ resource "google_secret_manager_secret_iam_member" "secret_access" {
      ~ etag      = "BwZNx6mTh3E=" -> (known after apply)
      ~ id        = "projects/freestar-491214/secrets/dev-example-api-app-secret/roles/secretmanager.secretAccessor/serviceAccount:exampleapi@freestar-491214.iam.gserviceaccount.com" -> (known after apply)
      ~ member    = "serviceAccount:exampleapi@freestar-491214.iam.gserviceaccount.com" -> "serviceAccount:devexampleapi@freestar-491214.iam.gserviceaccount.com" # forces replacement
      ~ secret_id = "projects/freestar-491214/secrets/dev-example-api-app-secret" -> "dev-example-api-app-secret"
        # (2 unchanged attributes hidden)
    }

  # module.service.google_service_account.runtime[0] must be replaced
-/+ resource "google_service_account" "runtime" {
      ~ account_id   = "exampleapi" -> "devexampleapi" # forces replacement
      ~ display_name = "example-api runtime" -> "dev-example-api runtime"
      ~ email        = "exampleapi@freestar-491214.iam.gserviceaccount.com" -> "devexampleapi@freestar-491214.iam.gserviceaccount.com"
      ~ id           = "projects/freestar-491214/serviceAccounts/exampleapi@freestar-491214.iam.gserviceaccount.com" -> (known after apply)
      ~ member       = "serviceAccount:exampleapi@freestar-491214.iam.gserviceaccount.com" -> "serviceAccount:devexampleapi@freestar-491214.iam.gserviceaccount.com"
      ~ name         = "projects/freestar-491214/serviceAccounts/exampleapi@freestar-491214.iam.gserviceaccount.com" -> (known after apply)
      ~ unique_id    = "100657971203144815552" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  ~ runtime_service_account_email = "exampleapi@freestar-491214.iam.gserviceaccount.com" -> "devexampleapi@freestar-491214.iam.gserviceaccount.com"
  ~ service_name                  = "example-api" -> "dev-example-api"
  ~ service_uri                   = "https://example-api-bklbobkrsq-uc.a.run.app" -> (known after apply)

```
</details>

*Approve the **dev** environment to trigger apply.*